In [1]:
import pandas as pd

### Задание 1

In [35]:
df_movies = pd.read_csv('movies.csv', sep=',')

In [36]:
df_ratings = pd.read_csv('ratings.csv', sep=',')

In [37]:
joined = df_ratings.merge(df_movies, on = 'movieId', how = 'left')
joined.head()

,userId,movieId,rating,timestamp,title,genres
0,1,296,5.0,1147880044,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
1,1,306,3.5,1147868817,Three Colors: Red (Trois couleurs: Rouge) (1994),Drama
2,1,307,5.0,1147868828,Three Colors: Blue (Trois couleurs: Bleu) (1993),Drama
3,1,665,5.0,1147878820,Underground (1995),Comedy|Drama|War
4,1,899,3.5,1147868510,Singin' in the Rain (1952),Comedy|Musical|Romance

In [40]:
rating_5 = joined[joined['rating'] == 5.0]['title'].value_counts()
rating_5.head(1)

Shawshank Redemption, The (1994)    39553
Name: title, dtype: int64

### Задание 2

In [55]:
data_power = pd.read_csv('power.csv', sep=',')
data_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [84]:
filtered_01 = data_power[data_power.country.isin(['Latvia', 'Lithuania', 'Estonia'])]
filtered_02 = filtered_01[filtered_01.category.isin([4,12,21])]
filtered_03 = filtered_02[(filtered_02['year'] >= 2005) & (filtered_02['year'] <= 2010) & (filtered_02['quantity'] > 0)]
filtered_03.head(1)

       country  year  quantity  category
10617  Estonia  2008       1.0         4

In [85]:
summ = filtered_03['quantity'].sum()
summ

240580.0

### Задание 3

In [37]:
data_currency = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')[0]
data_currency.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,3 835,"0,8%",Nasdaq,14 860,"0,2%",Биткойн,46 064,"-0,5%",USD/RUB,736650,"0,0%"
1,РТС,1 641,"0,5%",S&P500,4 432,"-0,1%",Нефть,691,"-0,1%",EUR/RUB,864715,"0,0%"
2,Dow,35 102,"-0,3%",FTSE100,7 132,"0,1%",Золото,1 735,"0,3%",EUR/USD,11739,"0,0%"